<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.williamtheaker.autopkg.munki.CbDefense</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CbDefense</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>CB Defense is a threat detection tool.</string>
			<key>developer</key>
			<string>Carbon Black</string>
			<key>display_name</key>
			<string>CB Defense</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
	<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
	<dict>
	<key>Processor</key>
	<string>CodeSignatureVerifier</string>
	<key>Arguments</key>
	<dict>
		<key>input_path</key>
		<string>%PKG%/*.pkg</string>
		<key>expected_authority_names</key>
		<array>
			<string>Developer ID Installer: Carbon Black, Inc. (7AGZNQ2S2T)</string>
			<string>Developer ID Certification Authority</string>
			<string>Apple Root CA</string>
		</array>
	</dict>
</dict>
<dict>
		<key>Processor</key>
		<string>Copier</string>
		<key>Arguments</key>
		<dict>
			<key>source_path</key>
			<string>%PKG%</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
		</dict>
</dict>
<dict>
		<key>Processor</key>
		<string>MunkiImporter</string>
		<key>Arguments</key>
		<dict>
			<key>pkg_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			<key>repo_subdirectory</key>
			<string>%MUNKI_REPO_SUBDIR%</string>
		</dict>
</dict>
</array>
</dict>
</plist>