<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Krita.</string>
    <key>Identifier</key>
    <string>com.github.williamtheaker.autopkg.download.Krita</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Krita</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
             <key>Processor</key>
             <string>URLTextSearcher</string>
             <key>Arguments</key>
             <dict>
                <key>url</key>
                <string>https://krita.org/en/download/krita-desktop/</string>
                <key>re_pattern</key>
                <string>https:\/\/download.kde.org\/stable\/krita\/[\d\.]*\/krita-[\d\.]*.dmg</string>
                <key>result_output_var_name</key>
                <string>download_url</string>
             </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_url%</string>
                <key>curl_opts</key>
                <array>
                    <string>-L</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            <key>Comment</key>
            <string>End new version phase.</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/krita.app</string>
                <key>requirement</key>
                <string>identifier "org.krita" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5433B4KXM8"</string>
            </dict>
         </dict>
    </array>
</dict>
</plist>
