<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Recipe description</string>
    <key>Identifier</key>
    <string>com.github.williamtheaker.autopkg.download.SoapUI</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>SoapUI</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://www.soapui.org/downloads/latest-release/</string>
          <key>re_pattern</key>
          <string>https:\/\/s3.amazonaws.com\/downloads.eviware\/soapuios\/[\d\.]*\/SoapUI-[\d\.]*.dmg</string>
          <key>result_output_var_name</key>
          <string>download_url</string>
        </dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%download_url%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
			<dict>
					<key>Processor</key>
					<string>CodeSignatureVerifier</string>
					<key>Arguments</key>
					<dict>
							<key>input_path</key>
							<string>%pathname%/SoapUI*Installer.app</string>
							<key>requirement</key>
        			<string>always</string>
					</dict>
			</dict>
    </array>
  </dict>
</plist>
