<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads (not really because I need a JSON file or similar with the Zscaler release numbering) the latest version of Zscaler and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.williamtheaker.autopkg.munki.Zscaler</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Zscaler</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Zscaler is an app to enforce secure access to enterprise applications.</string>
			<key>developer</key>
			<string>Zscaler</string>
			<key>display_name</key>
			<string>Zscaler</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>uninstall_method</key>
			<string>/Applications/Zscaler/.Uninstaller.sh</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.zscaler</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>