<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the requested version of Zscaler and installs it.</string>
    <key>Identifier</key>
    <string>com.github.williamtheaker.autopkg.install.Zscaler</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Zscaler</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.williamtheaker.autopkg.download.Zscaler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
