<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the requested version of Zscaler and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.williamtheaker.autopkg.munki.Zscaler</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>Zscaler</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Zscaler is an application for enforcing secure access to enterprise applications.</string>
            <key>developer</key>
            <string>Zscaler</string>
            <key>display_name</key>
            <string>Zscaler</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>uninstall_method</key>
            <string>#!/bin/bash
            /Applications/Zscaler/.Uninstaller.sh
            pkgutil --forget=com.zscaler.zscaler.pkg
            </string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MiniumumVersion</key>
    <string>2.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.williamtheaker.autopkg.pkg.Zscaler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Zscaler/Zscaler.app</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
