<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads (not really because I need a JSON file or similar with the Zscaler release numbering) the latest version of Zscaler and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.williamtheaker.autopkg.munki.Zscaler</string>
	<key>Input</key>
	<dict>
		<key>VENDOR</key>
        <string>Zscaler</string>
        <!--See https://help.zscaler.com/z-app/customizing-zscaler-app-install-options-macos-->
        <!--for configuration options-->
        <!--CLOUDNAME corresponds to the value given to the cloudName switch-->
        <key>CLOUDNAME</key>
        <string></string>
        <!--DEVICETOKEN corresponds to the value given to the deviceToken switch-->
        <key>DEVICETOKEN</key>
        <string></string>
        <!--HIDEAPPUIONLAUNCH corresponds to the value given to the hideAppUIOnLaunch switch-->
        <key>HIDEAPPUIONLAUNCH</key>
        <string></string>
        <!--MODE corresponds to the value given to the mode switch-->
        <key>MODE</key>
        <string></string>
        <!--POLICYTOKEN corresponds to the value given to the policyToken switch-->
        <key>POLICYTOKEN</key>
        <string></string>
        <!--REINSTALLDRIVER corresponds to the value given to the reinstallDriver switch-->
        <key>REINSTALLDRIVER</key>
        <string></string>
        <!--STRICTENFORCEMENT corresponds to the value given to the strictEnforcement switch-->
        <key>STRICTENFORCEMENT</key>
        <string></string>
        <!--UNATTENDEDMODEUI corresponds to the value given to the unattendedmodeui switch-->
        <key>UNATTENDEDMODEUI</key>
        <string></string>
        <!--USERDOMAIN corresponds to the value given to the userDomain switch-->
        <key>USERDOMAIN</key>
        <string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Zscaler</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Zscaler is an app to enforce secure access to enterprise applications.</string>
			<key>developer</key>
			<string>Zscaler</string>
			<key>display_name</key>
			<string>Zscaler</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.zscaler</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>