<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Zscaler.</string>
	<key>Identifier</key>
	<string>com.github.williamtheaker.autopkg.download.Zscaler</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zscaler</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			 <key>Processor</key>
			 <string>URLTextSearcher</string>
			 <key>Arguments</key>
			 <dict>
					 <key>url</key>
					 <string>https://help.zscaler.com/zapi/fetch-data?url_alias=/zscaler-client-connector/client-connector-app-release-summary-2021&amp;view_type=full&amp;applicable_category=macos&amp;_format=json</string>
					 <key>result_output_var_name</key>
					 <string>version</string>
					 <key>re_pattern</key>
					 <string>([\d\.]*)(?= for macOS)</string>
			 </dict>
		 </dict>
		<dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://d32a6ru7mhaq0c.cloudfront.net/Zscaler-osx-%version%-installer.app.zip</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
				<key>Comment</key>
				<string>End new version phase.</string>
    </dict>
		<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
						<key>archive_path</key>
						<string>%pathname%</string>
						<key>destination_path</key>
						<string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
						<key>purge_destination</key>
						<true/>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
						<key>pattern</key>
						<string>%RECIPE_CACHE_DIR%/%VENDOR%/Zscaler-osx-*-installer.app</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
						<key>input_path</key>
						<string>%found_filename%</string>
						<key>requirement</key>
						<string>identifier "com.zscaler.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PCBCQZJ7S7</string>
				</dict>
		</dict>
	</array>
</dict>
</plist>
