<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Nessus and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.autopkg.munki.Nessus</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>Nessus</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Nessus is a vulnerability assessment tool.</string>
            <key>developer</key>
            <string>Tenable</string>
            <key>display_name</key>
            <string>Nessus Agent</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.autopkg.download.Nessus</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/.NessusAgent.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/NessusAgent/run/bin/nasl</string>
                    <string>/Library/NessusAgent/run/sbin/nessus-agent-module</string>
                    <string>/Library/NessusAgent/run/sbin/nessus-service</string>
                    <string>/Library/NessusAgent/run/sbin/nessusd</string>
                    <string>/Library/NessusAgent/run/sbin/nessusmgt</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>installcheck_script</key>
                    <string>#!/bin/zsh

# binaries
cli="/Library/NessusAgent/run/sbin/nessuscli"
service="/Library/NessusAgent/run/sbin/nessus-service"

# versions
current_version=$($cli --version | awk 'NR==1{print $4}')
target_version=%version%

# install status outcomes
missing="Did not detect a Tenable Nessus install (target version: ${target_version}). Install/update needed."
outdated="Detected an outdated Tenable Nessus (current version ${current_version}, target version: ${target_version}). Install/update needed."
updated="Detected an up-to-date Tenable Nessus (current version: ${current_version}, target version: ${target_version}). No install/update needed."
installed=1
not_installed=0

if [[ ! -f "$cli" ]] || [[ ! -f "$service" ]]; then
    echo "$missing"
    exit "$not_installed"
elif [[ "$current_version" != "$target_version" ]]; then
    echo "$outdated"
    exit "$not_installed"
elif [[ "$current_version" == "$target_version" ]]; then
    echo "$updated"
    exit "$installed"
else
    exit 0
fi
                    </string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.williamtheaker.MunkiReceiptsEditor/MunkiReceiptsDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>pkgs_ids</key>
                <array>
                    <string>com.tenablesecurity.NessusAgent.Preferences</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
