<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Nessus and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.williamtheaker.autopkg.munki.Nessus</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Nessus</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Nessus is a vulnerability assessment tool.</string>
			<key>developer</key>
			<string>Tenable</string>
			<key>display_name</key>
			<string>Nessus Agent</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.williamtheaker.autopkg.download.Nessus</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
	      <key>Arguments</key>
	      <dict>
	          <key>additional_pkginfo</key>
	          <dict>
	              <key>version</key>
	              <string>%version%</string>
								<key>installcheck_script</key>
								<string>#!/bin/bash

target_version=%version%

if [ -f "/Library/NessusAgent/run/sbin/nessus-service" ]; then
  current_version=$(/Library/NessusAgent/run/sbin/nessus-service -v | grep 'build' | awk '{print $3}')
  if [ "$current_version" == "$target_version" ]; then
    exit 1
  fi
fi

exit 0
</string>
	          </dict>
	      </dict>
      </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
