<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads drivers for AX88179 ethernet adapter, such as StarTech USB31000S, and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.williamtheaker.autopkg.munki.AX88179</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>AX88179</string>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
      <string>RequireRestart</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Drivers</string>
			<key>description</key>
			<string>Drivers for StarTech USB31000S ethernet adapter.</string>
			<key>developer</key>
			<string>Asix</string>
			<key>display_name</key>
			<string>StarTech USB ethernet drivers</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.williamtheaker.autopkg.download.AX88179</string>
	<key>Process</key>
	<array>
		<dict>
			 <key>Processor</key>
			 <string>FileFinder</string>
			 <key>Arguments</key>
			 <dict>
				 <key>pattern</key>
				 <string>%RECIPE_CACHE_DIR%/AX88179*.pkg</string>
			 </dict>
	 </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
