<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads drivers for AX88179 ethernet adapter, such as StarTech USB31000S.</string>
    <key>Identifier</key>
    <string>com.github.williamtheaker.autopkg.download.AX88179</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AX88179</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.asix.com.tw/download.php?sub=driverdetail&amp;PItemID=131</string>
                <key>result_output_var_name</key>
                <string>download_url</string>
                <key>re_pattern</key>
                <string>href='(\S*.zip)'>(?=Apple Mac OS X)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.asix.com.tw/download.php?sub=driverdetail&amp;PItemID=131</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>re_pattern</key>
                <string>href='FrootAttach/driver/AX88179_178A_macintosh_Driver_Installer_v(\S*).zip'>(?=Apple Mac OS X)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                    <key>url</key>
                    <string>https://www.asix.com.tw/%download_url%</string>
                    <key>filename</key>
                    <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            <key>Comment</key>
            <string>End new version phase.</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/AX88179*/AX88179*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%/AX88179*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/AX88179*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: ASIX ELECTRONICS CORPORATION (5RHFAZ9D4P)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
         </dict>
    </array>
</dict>
</plist>
