<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads releases of Teleport specified by MAJOR_VERSION.</string>
    <key>Identifier</key>
    <string>com.github.williamtheaker.autopkg.download.Teleport</string>
    <key>Input</key>
    <dict>
        <key>MAJOR_VERSION</key>
        <string>10</string>
        <key>NAME</key>
        <string>Teleport</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://dashboard.gravitational.com/webapi/releases-oss?product=teleport&amp;page=0</string>
            <key>re_pattern</key>
            <string>https:\/\/get.gravitational.com\/teleport-(%MAJOR_VERSION%\.[\d\.]*).pkg</string>
            <key>result_output_var_name</key>
            <string>version</string>
        </dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://get.gravitational.com/teleport-%version%.pkg</string>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>input_path</key>
            <string>%pathname%</string>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Gravitational Inc. (QH8AA5B8UP)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
