<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Recipe description</string>
    <key>Identifier</key>
    <string>com.github.williamtheaker.autopkg.download.Teleport</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Teleport</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://goteleport.com/download/?os=mac</string>
            <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
                </dict>
            <key>re_pattern</key>
            <string>publicUrl":"https://cdn.teleport.dev/teleport-([0-9]+(\.[0-9]+)+).pkg"</string>
            <key>result_output_var_name</key>
            <string>version</string>
        </dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cdn.teleport.dev/teleport-%version%.pkg</string>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>input_path</key>
            <string>%pathname%</string>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Gravitational Inc. (QH8AA5B8UP)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
